Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Clinic of Horrors.tmx
Source language: en
Languages: es_419

source: If those mouth infections are allowed to remain... he’ll die of sepsis.
es_419: Si no se curan esas infecciones bucales… morirá de sepsis.

source: Please!!!
es_419: ¡¡¡Por favor!!!

source: GAMING CAFE
es_419: ETERNO JUGADOR

source: I have been feeling strange lately...
es_419: Últimamente me he sentido raro…

source: Absolutely!
es_419: ¡Por supuesto!

source: I made a lot of money on this.
es_419: Gané mucho dinero con esto.

source: We just press this button!
es_419: ¡Solo tocamos este botón!

source: Do you have any medicine for that, young one?
es_419: ¿Tienes algún remedio para eso, jovencita?

source: Here is today’s fanart feature.
es_419: Aquí está el fan art de hoy.

source: See you on monday.
es_419: Nos vemos el lunes.

source: FEEDING COMMENCING.
es_419: INICIA ALIMENTACIÓN.

source: Look at that jaundice.
es_419: Tiene ictericia.

source: Some weird things have been happening lately...
es_419: Últimamente han pasado unas cosas extrañas…

source: A “Dr.
es_419: Parece que a

source: HAHAHA!
es_419: ¡JAJAJA!

source: I said what will happen to him?!
es_419: ¡¿Qué pasará con él?!

source: Giving them too much to read can paralyze them.
es_419: Si les das mucho para leer, se paralizan.

source: That sounds good.
es_419: Suena bien.

source: A mutation that big?!
es_419: ¡¿Una mutación así de grande?!

source: So much energy!!
es_419: ¡¡Cuánta energía!!

source: ... visiting someone.
es_419: … visité a alguien.

source: @coconuthound on
es_419: @coconuthound en

source: You can’t legally prescribe painkillers.
es_419: No puedes prescribir analgésicos de forma legal.

source: Aha
es_419: jaja

source: ETERNAL
es_419: EL CAFÉ DEL

source: It huuuurts....
es_419: Dueeeeleeee…

source: BOOBIES SPACE MARINES
es_419: PECHOS Y MARINES ESPACIALES

source: listen... miss...
es_419: Mire… Señorita…

source: Edited by
es_419: Editado por

source: GAME FOREV
es_419: ¡JUEGA POR SIEMPRE!

source: Please help...
es_419: ¡Por favor, ayuda!

source: Bianca, turn on the television!
es_419: ¡Bianca, enciende la televisión!

source: Uh...Bianca, why did you do that?
es_419: Eh… Bianca, ¿por qué hiciste eso?

source: A book worm!
es_419: ¡Un gusalibro!

source: Needs further study.
es_419: Hay que seguir investigando.

source: SLURP
es_419: ÑUUMP

source: Look at the comfort and convenience!
es_419: ¡Mira ese bienestar y comodidad!

source: Medicine, eh?
es_419: Medicina, ¿eh?

source: Another boring day...
es_419: Otro tedioso día…

source: We can’t help everyone.
es_419: No podemos ayudarlos a todos.

source: Thank you so much! follow
es_419: ¡Muchas gracias! Sigue a

source: STEP
es_419: PAC

source: PLAY IN
es_419: ¡JUEGUE CON

source: More publicity is always welcome!
es_419: ¡La publicidad siempre es bienvenida!

source: Weeks
es_419: Semanas

source: @Mayo_umai on
es_419: @Mayo_umai en

source: PokuriMio is an artist from the US and often draws live on Twitch.
es_419: PokuriMio es una artista de los EE. UU. que suele dibujar en vivo en Twitch.

source: RAINBOW
es_419: ARCOÍRIS

source: I would like to ask a question.
es_419: Quisiera hacerle una pregunta.

source: Only the colorful world of your favorite game!
es_419: ¡Solo tú y el mundo colorido de tu juego favorito!

source: I’m a doctor, after all.
es_419: Soy un doctor, después de todo.

source: Please... don’t...
es_419: Por favor… No…

source: My...dad?
es_419: ¿Mi… padre?

source: Relax now.
es_419: Relájate.

source: "Written by
es_419: “Escrito por

source: ...Fine.
es_419: …Bien.

source: Now!!
es_419: ¡¡Ya!!

source: ...Not yet.
es_419: … Aún no.

source: W...what?
es_419: ¿Q… qué?

source: They say it tastes like sweet fruits, and gives you crazy determination!!
es_419: ¡¡Dicen que tiene un sabor dulce, como a frutas, y que te hace ser más decisivo!!

source: Inconsiderate assholes.
es_419: idiotas desconsiderados.

source: I don’t have any parents.
es_419: No tengo padres.

source: SQUISH
es_419: CHUIC

source: Many years ago...
es_419: Hace unos años…

source: He needs help!
es_419: ¡Necesita ayuda!

source: Yes.
es_419: Sí.

source: Naturally.
es_419: Desde luego.

source: ...What is it?
es_419: …¿Qué es esto?

source: I never thought a human would wanna help one of us!
es_419: ¡Nunca pensé que un humano querría ayudarnos!

source: Hm?
es_419: ¿Mm?

source: Aaaaaaah it worked!!
es_419: ¡¡Aaaaaaah, funcionó!!

source: Hehe, I have so much time to do crafting now!
es_419: ¡je, je, ahora tengo tiempo para fabricar cosas!

source: On the contrary, the eternal gaming act makes it perfectly legal.
es_419: Al contrario, la ley del eterno jugador lo hace muy legal.

source: SNAP
es_419: FUSH

source: Thank you so much!
es_419: ¡Muchas gracias!

source: Come back.
es_419: Vuelve.

source: Well...
es_419: Bueno…

source: *look*
es_419: *mira*

source: Why are we here, Doctor?
es_419: ¿Por qué está aquí, doctor?

source: What do you want, doctor?
es_419: ¿Qué quiere, doctor?

source: Hey.
es_419: Oye.

source: This is great!!
es_419: ¡¡Increíble!!

source: ITY
es_419: DAD

source: IT
es_419: DA

source: Gyaaaah!!!
es_419: ¡¡¡Aaahhgg!!!

source: Finally someone came!
es_419: ¡Por fin alguien viene!

source: ...Hello.
es_419: … Hola.

source: Don’t let them take me away!
es_419: ¡No dejen que me lleven!

source: In a strange city, there is a clinic that will treat the victims of horrific diseases.
es_419: En una extraña cuidad hay una clínica que cura a las víctimas de enfermedades horripilantes…

source: Sleep Deprivation
es_419: Privación del sueño

source: Help me, human girl...!
es_419: ¡Ayúdame, niña humana…!

source: Are you sure, son?!
es_419: ¡¿Niño, estás seguro?!

source: Follow me!
es_419: ¡Sígueme!

source: Yah, dude!
es_419: ¡Sí, viejo!

source: SLAM
es_419: BAAM

source: I’ll bet his liver isn’t worth shit.
es_419: Apuesto a que su hígado no vale nada.

source: Good morning, sir!
es_419: ¡Buenos días!

source: en
es_419: to

source: I’ve been trying my luck for weeks to get help!
es_419: ¡Llevo semanas intentando conseguir ayuda!

source: Art by
es_419: Arte por

source: CONNECTS TO THE EYE & BRAIN
es_419: SE CONECTA AL OJO Y AL CEREBRO

source: ENJOY ETERNAL GAMING!
es_419: ¡DISFRUTA, ETERNO JUGADOR!

source: Later...
es_419: Luego…

source: You got close to destroying the entire district!
es_419: ¡Casi destruyes todo el distrito!

source: We can create a better world!
es_419: ¡Podremos crear un mejor mundo!

source: It’s so great!
es_419: ¡Es genial!

source: Sleep (ADVISED!)
es_419: Dormir (¡RECOMENDABLE!)

source: Please help!
es_419: ¡Por favor, ayuda!

source: The chairman wants to talk to you too, Peter.
es_419: El Presidente también quiere hablar contigo, Peter.

source: MERRY CHRISTMAS
es_419: Feliz Navidad

source: It would attract more customers!
es_419: ¡Atraería más clientes!

source: We will see if it works.
es_419: Veremos si funciona.

source: HA!
es_419: ¡JA!

source: Don’t worry, baby.
es_419: No te preocupes, cielo.

source: GAMING CAFé
es_419: ETERNO JUGADOR

source: Bathroom
es_419: BAÑO

source: When I say, throw them into its mouth.
es_419: A mi señal, se las tiramos en la boca.

source: And then,
es_419: ¡Y luego,

source: And now that we are al united under one corporation, there’s no need for capitalism to interrupt our research.
es_419: Y ahora que estamos todos unidos bajo una corporación, no hay necesidad de que el capitalismo interrumpa nuestras investigaciones.

source: AHAHA
es_419: JAJAJA

source: There exists drugs to help you sleep, but generally it’s advised you try to get a natural sleep.
es_419: Existen medicamentos que te ayudan a dormir, pero lo recomendable es que trates de hacerlo sin ellos.

source: Brutal but excellent question, Bianca!
es_419: ¡Una pregunta brutal, pero excelente, Bianca!

source: Do you visit your parents?
es_419: ¿Visitas a tus padres?

source: It’s okay, we just need a small sample of it.
es_419: Está bien. Tomaremos una pequeña muestra de eso.

source: Bianca has been in a bad mood lately...
es_419: Últimamente Bianca ha estado de mal humor…

source: That’s okay.
es_419: Bueno.

source: CH
es_419: AG

source: Thank you so much! follow @_.snownya._ on
es_419: ¡Muchas gracias! Sigue a @_.snownya._ en

source: You are so young.
es_419: Eres tan joven.

source: Heeelllp...
es_419: Ayuuuuddaa…

source: *Squat*
es_419: *Se agacha*

source: It’s alright, let her pass.
es_419: Está bien, déjenla pasar.

source: I’m your dad, Bianca.
es_419: Soy tu padre, Bianca.

source: FUN!
es_419: ¡DIVERSIÓN!

source: The Nostalgia Brain Parasite infects people through the eyes and causes people to see things through a nostalgic filter, while it feeds off the brain’s fluids.
es_419: El parásito de la nostalgia del cerebro infecta a las personas a través de los ojos y les hace ver cosas con un filtro nostálgico mientras se alimenta de los fluidos cerebrales.

source: Unless you have another payment method...
es_419: A menos que tenga otro medio de pago…

source: Yes...
es_419: Sí…

source: Sorry.
es_419: Perdón.

source: Thank you..
es_419: Gracias…

source: YAH!
es_419: ¡AAH!

source: Never mind that.
es_419: No importa.

source: Hahaha!! is it your first time?
es_419: ¡¡jajaja!! ¿eres nueva aquí?

source: HAHA!
es_419: ¡JAJA!

source: Phew...
es_419: Guau…

source: Let’s go try it after class!
es_419: ¡Vayamos y probémosla después de clase!

source: I’m a nurse. obviously I’m going to help if someone asks for help.
es_419: Soy una enfermera. Por supuesto que ayudaré a quien pida por ello.

source: -Like magical girls fighting evil and injustice!
es_419: -¡Como chicas mágicas luchando contra el mal y la injusticia!

source: It feeds off the nostalgia in the host’s brain.
es_419: Se alimenta de la nostalgia en el cerebro del huésped.

source: Bianca fact time!
es_419: ¡Datos de Bianca!

source: Post your fan art on twitter or Instagram with the hashtag “#clinicofhorrors” for a chance to get featured!
es_419: ¡Sube tu dibujo a Twitter o Instagram con el hashtag “#clinicofhorrors” para que te mencionemos!

source: It’s obviously not human.
es_419: Es obvio que no es un humano.

source: Perhaps you can treat my illness.
es_419: Tal vez puedas curar mi enfermedad.

source: -Hey, what’s going on, ladies? -Michaelis, you look so cool!!
es_419: -Ey, chicas, ¿qué sucede? -¡¡Michaelis, luces tan bien!!

source: This isn’t safe.
es_419: Esto es inseguro.

source: @napiart92 on
es_419: @napiart92 en

source: Pl...
es_419: Por…

source: I hungerrrrrrr....
es_419: Tengo apetiiitooo…

source: Come back when you want to set up your subscription!
es_419: ¡Vuelve cuando quieras iniciar tu suscripción!

source: Good job, Bianca!
es_419: ¡Bien hecho, Bianca!

source: Mentally healthy people don’t choose to come to a place like this.
es_419: Personas mentalmente sanas no eligen venir a lugares como este.

source: Wh...
es_419: Qu…

source: Girl!
es_419: ¡Niña!

source: If you’re happy with your life, press the button and you will go back to the simulation.
es_419: Si está feliz con su vida, presione el botón y regresará a la simulación.

source: You can call a cab or family member.
es_419: Puede llamar un taxi o a un familiar.

source: 90’s ANIME STYLE
es_419: COMO LOS ANIME DE LOS 90

source: Good morning, sleepyhead!
es_419: ¡Buenos días, dormilón!

source: Thank you for helping me!
es_419: ¡Gracias por ayudarme!

source: What do you do, young one?
es_419: ¿A qué te dedicas, jovencita?

source: -2hp
es_419: -2pv

source: Don’t you see?
es_419: ¿Lo ves?

source: A single vaccination costs upwards of $500 now.
es_419: Hoy una sola vacuna está por encima de los $500.

source: Cover it!!
es_419: ¡¡Tápalo!!

source: I’m going to get more printing paper.
es_419: Saldré a comprar más papel para imprimir.

source: You see, I’m stuck in a cage.
es_419: Mira, estoy encerrado en esta jaula.

source: Wow!
es_419: ¡Guau!

source: Here’s one of our newer customers!
es_419: ¡Este es uno de nuestros nuevos clientes!

source: I am, but an operation on such a large specimen will take weeks for just us.
es_419: Sí, pero una operación en un espécimen tan grande nos llevará semanas.

source: Pfah...
es_419: Paaf…

source: The yellow corporation
es_419: Corporación amarillo.

source: I...
es_419: No…

source: Put me back!!
es_419: ¡¡Quiero volver!!

source: Bianca, did you hear about that new energy drink?
es_419: Bianca, ¿escuchaste sobre la nueva bebida energética?

source: To fund our research, of course.
es_419: Para financiar nuestra investigación, por supuesto.

source: Bwaaa!!!
es_419: ¡¡¡Buaaa!!!

source: WEEEWOOOWEEEW
es_419: UIIIUUUUUIIII

source: E
es_419: S

source: As you say.
es_419: Como usted diga.

source: DINK!
es_419: ¡TINC!

source: So why are prices still getting higher?
es_419: Así que, ¿por qué los precios siguen aumentando?

source: SECUR
es_419: SEGURI

source: ...united under your ownership, you mean.
es_419: …unidos bajo su control, querrá decir.

source: Sometimes a credit card gets declined.
es_419: A veces las tarjetas de crédito son rechazadas.

source: OPEN MOUTH.
es_419: ABRA LA BOCA.

source: I guess...
es_419: Creo…

source: @prodigykl9029 on
es_419: @prodigykl9029 en

source: What do you do on your weekends?
es_419: ¿qué haces los fines de semana?

source: Outta my way!
es_419: ¡Córranse!

source: GAMING
es_419: JUEGA

source: Medicine marketed specifically to businessmen have become very popular there.
es_419: La medicina que se vende específicamente para los empresarios se ha vuelto muy popular allí.

source: The human body wouldn’t last with just this set up.
es_419: Un humano no durará solo con este sistema.

source: Stop talking to me.
es_419: No me hable.

source: Ehehe
es_419: jeje

source: It’ll be interesting to see what happened here!
es_419: ¡Será muy interesante saber qué pasó aquí!

source: Earlier...
es_419: Antes…

source: They live of serotonin chemicals in the brains of the humans they consume.
es_419: Viven de la serotonina en los cerebros de los humanos que consumen.

source: It enters his stomach through this tube here.
es_419: Ingresa a su estómago por este tubo de aquí.

source: What?
es_419: ¡¿Qué?!

source: KNOCK
es_419: TOOC

source: I don’t have any family...
es_419: No tengo familia…

source: Your entire life, up until this point, has been part of an advanced simulation!
es_419: ¡Toda su vida, hasta ahora, ha sido parte de una simulación avanzada!

source: Ah, you’re putting the final star on the tree?
es_419: Oh, ¿estás colocando la estrella en el árbol?

source: STRAIGHT TO THE STOMACH!
es_419: DIRECTO AL ESTÓMAGO

source: Please follow me!
es_419: ¡Sígueme, por favor!

source: Sarah threw up today.
es_419: Hoy Sarah vomitó.

source: Trust me!
es_419: ¡Créeme!

source: THE END IS NIGH
es_419: ¡EL FINAL SE AVECINA!

source: All booths have this sticker!
es_419: ¡Todas las cabinas tienen esto!

source: Hlep me!
es_419: ¡Ayuda!

source: Haa...
es_419: Aah…

source: Push
es_419: Empuja

source: We give him a formula at regular intervals that fulfills every dietary need. all-vegetarian too!
es_419: Le damos una fórmula con regularidad que satisface sus necesidades alimenticias. ¡Todo vegetariano!

source: JRRCHHH!!
es_419: ¡¡CRIICH!!

source: Nutritious!
es_419: ¡Nutrientes!

source: Done?
es_419: ¿Se cansó?

source: There was one girl who stopped by...
es_419: Hubo una chica que pasó…

source: That sounds amazing!!
es_419: ¡¡Eso es estupendo!!

source: The drug industry tried to cure it.
es_419: la industria farmacéutica intentó solucionarlo.

source: GAME FOREVER!
es_419: ¡JUEGA POR SIEMPRE!

source: HA
es_419: JA

source: Tell me more about that.
es_419: Cuéntame más.

source: Hey!
es_419: ¡Oye!

source: SHLURP
es_419: WUOOMP

source: -What is it, Sarah?
es_419: -¿Qué es, Sarah?

source: Arcade
es_419: DE DISPAROS

source: Excuse me,
es_419: ¡Disculpe,

source: It’s alive.
es_419: Tiene vida.

source: ... mom?
es_419: … ¿Mamá?

source: Kyahaha! ahaha!
es_419: ¡Aaaayy! ¡jaja!

source: Wow!!
es_419: ¡¡Guau!!

source: The damages caused to the city were manageable.
es_419: Pudimos manejar los destrozos causados en la ciudad.

source: So, Bianca.
es_419: Bianca,

source: Ohoo man!!
es_419: ¡¡Está genial!!

source: This is... extraordinary...
es_419: Esto es… impresionante…

source: i don’t care.
es_419: No me interesa.

source: Oh!
es_419: ¡Ah!

source: Why are you touching me?
es_419: ¿Por qué me toca?

source: Let me know if it’s good!
es_419: ¡Dime si es bueno!

source: You ready, Bianca?
es_419: ¿Lista, Bianca?

source: SHLORP
es_419: SHUOMP

source: Seratonin if human consumed.
es_419: La serotonina de los humanos.

source: HYGIENE?
es_419: ¿HIGIENE?

source: If someone has a bad life, why not let them live a better one here?
es_419: Si la vida de alguien es mala, ¿por qué no dejarle vivir una mejor aquí?

source: I’m sorry, sir, your card was declined.
es_419: Lo sentimos, señor, su tarjeta fue rechazada.

source: INSIDE THE BOOKWORM
es_419: DENTRO DEL GUSALIBRO

source: That’s true!
es_419: ¡Es verdad!

source: 2 weeks later...
es_419: 2 semanas después…

source: We do filter the air, too.
es_419: También filtramos el aire.

source: I gotchu.
es_419: Te protegeré.

source: shhhh
es_419: gghhh

source: I’ll be right back.
es_419: Enseguida regreso.

source: Providing free medicine to cure the afflicted.
es_419: brindando medicina gratis para curar a los afectados.

source: HAha!!
es_419: ¡¡JAJA!!

source: Something crazy must’ve happened!
es_419: ¡Debió de haber pasado algo terrible!

source: The Capital City fnancial district is filled to the brim with offices and the people who work in them.
es_419: El distrito financiero de Ciudad Capital está lleno de oficinas y personas que trabajan allí.

source: Uh...
es_419: Ah…

source: You told me to put it on.
es_419: Usted me dijo que me lo pusiera.

source: No chewing!
es_419: ¡Sin masticar!

source: BLUB
es_419: BLOP

source: No more cooking!
es_419: ¡Nada de cocinar!

source: How fun.
es_419: ¡Qué divertido!

source: That’s correct.
es_419: Así es.

source: Oh, a friend?
es_419: Ah, ¿una amiga?

source: PREMIUM
es_419: PRÉMIUM

source: HEALTH?
es_419: ¿SALUD?

source: you can play video games for as long as you want!
es_419: ¡Puedes jugar videojuegos el tiempo que quieras!

source: FOOD?
es_419: ¿COMIDA?

source: Oh yeah?
es_419: Ah, ¿sí?

source: Sure!
es_419: ¡Perfecto!

source: - Bianca, something is happening!
es_419: - ¡Bianca algo extraño sucede!

source: That dress looks really cute on you, Bianca!
es_419: ¡Te ves linda con ese vestido, Bianca!

source: We exist because people choose us!
es_419: ¡Existimos porque la gente nos elige!

source: She’s with me.
es_419: Viene conmigo.

source: You can read.
es_419: ¡Puedes leer sobre ello

source: Hi.
es_419: Hola.

source: Huh?
es_419: ¿Eh?

source: You should smile more!
es_419: ¡Deberías sonreír más!

source: AMBULANCE
es_419: AMBULANCIA

source: Injection
es_419: Inyección

source: People are free to get up and use them if they want.
es_419: Los clientes pueden levantarse y usarlas si quieren.

source: Hhhuuuuuman...
es_419: Humaaaanossss…

source: Now we can call a removal team.
es_419: Ahora podemos llamar al equipo de limpieza.

source: To the eternal gaming cafe!
es_419: al café del eterno jugador!

source: Let go.
es_419: Suéltame.

source: Who are trying the one month trial!
es_419: quienes hacen el primer mes de prueba!

source: Do you think having a monopoly on the entire pharmaceutical industry is morally right?!
es_419: ¡¿Usted cree que tener un monopolio de toda la industria farmacéutica es moralmente correcto?!

source: Causing the host to see hallucinations stemming from their Nostalgic memories.
es_419: Hace que el huésped vea alucinaciones causadas por sus recuerdos de la nostalgia.

source: GOOD MORNING!!
es_419: ¡¡Buenos días!!

source: The yellow corporation.
es_419: La corporación amarillo.

source: You’re not allowed to be here!
es_419: ¡No puedes estar aquí!

source: How?
es_419: ¿Cómo?

source: I am sick!
es_419: ¡Estoy enfermo!

source: I hear your business is going well?
es_419: ¿Parece que tu negocio va bien?

source: The drugs already work!
es_419: ¡Los medicamentos funcionan!

source: Your card was declined.
es_419: Su tarjeta fue rechazada.

source: What are your symptoms?
es_419: ¿Cuáles son sus síntomas?

source: Let’s cure our patient.
es_419: Curemos a nuestro paciente.

source: All the people who can’t afford your premium service!
es_419: ¡Todas las personas que no pueden pagar tu servicio prémium!

source: click
es_419: tiic

source: Open it!
es_419: ¡Ábrelo!

source: THE
es_419: EL

source: Do it without me.
es_419: Háganlo sin mí.

source: FROM
es_419: con amor

source: Let me show you.
es_419: Tan solo mira.

source: After all,
es_419: Después de todo,

source: That was my idea, actually!
es_419: ¡Fue idea mía!

source: I haven’t slept in 26 days...
es_419: Hace 26 días que no duerno…

source: Here we are, miss...
es_419: Llegamos, señorita…

source: Now wait a minute...
es_419: Espera…

source: Extra convenient!
es_419: ¡Muy conveniente!

source: When the mutations started, we were there,
es_419: Cuando las mutaciones comenzaron, estuvimos allí

source: do you wanna give it a go, miss?
es_419: ¿Quieres intentarlo?

source: What’s your problem?!
es_419: ¡¿Cuál es su problema?!

source: 4 months later...
es_419: 4 meses después…

source: ALERT.
es_419: ALERTA.

source: BLEUGHEUGH
es_419: BLUAGHUAGH

source: We provide showers.
es_419: Tenemos duchas.

source: SECURITY
es_419: SEGURIDAD

source: Hungerrr... for...
es_419: Apetitooo… por…

source: Let’s go get some ice cream!
es_419: ¡Vayamos por un helado!

source: Thank you so much, Ole!
es_419: ¡Muchas gracias, Ole!

source: clack
es_419: taac

source: That was a tough one.
es_419: Ese sí que costó.

source: A cage of flesh and bones.
es_419: Una hecha de huesos y carne.

source: Take all of my cash!
es_419: ¡Toma todo mi dinero!

source: Great!
es_419: ¡Genial!

source: For the rest of your life!
es_419: ¡Por el resto de tu vida!

source: Oh...
es_419: Ah…

source: There are so many nice people like you!
es_419: ¡Hay muchas personas buenas como tú!

source: BREAKING NEWS
es_419: ÚLTIMO MOMENTO

source: What about hygiene?
es_419: ¿Y la higiene?

source: There are beds available in the other room.
es_419: Hay camas disponibles en la otra habitación.

source: Yes!!
es_419: ¡¡Sí!!

source: AMAZING job!!
es_419: ¡¡GRAN trabajo!!

source: Nothing indulgent is fully safe, but we encourage you to play in moderation!
es_419: ¡Lo servicial no es del todo seguro, pero te alentamos a jugar con moderación!

source: A bookworm at this size requires a different solution.
es_419: Un gusalibro de este tamaño requiere una solución diferente.

source: Hey you alright, buddy?
es_419: ¿Ey, amigo, estás bien?

source: Written by
es_419: Escrito por

source: Everything hurts badly!
es_419: ¡Me muero del dolor!

source: SLAM!
es_419: ¡PLAM!

source: Over here!
es_419: ¡Por aquí!

source: Doctor, I’m heading home for the day.
es_419: Doctor, me iré a casa.

source: Woah woah woaah!!
es_419: ¡¡Guau Guau Guau!!

source: For...
es_419: Por…

source: PAT
es_419: TAC

source: How splendid!
es_419: ¡Espléndido!

source: Goodbye, Bianca.
es_419: Adiós, Bianca.

source: That’s right, Bianca!
es_419: ¡Así es, Bianca!

source: You came!
es_419: ¡Viniste!

source: What?!
es_419: ¡¿Qué?!

source: Okay.
es_419: Bueno.

source: WOuld you like to get started on our trial period?
es_419: ¿Quieres empezar con tu período de prueba?

source: Just enjoy yourself!
es_419: ¡Solo diversión!

source: But...
es_419: Pero…

source: If they stay in their comfortable seats, then that’s their choice.
es_419: Es su elección si deciden quedarse en sus cómodos asientos.

source: When the united states economy tanked, we were there
es_419: Cuando la economía de los Estados Unidos cayó, estuvimos allí
